#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.invitations.random_id.bucket: Refreshing state... [id=9Gw7CQ]
module.s3website["davidbornitz.dev"].random_id.bucket: Refreshing state... [id=OkYQpA]
module.s3website["resume.davidbornitz.dev"].random_id.bucket: Refreshing state... [id=wemegA]
aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=E2IARHGO3S8MHZ]
module.s3website["resume.davidbornitz.dev"].aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=E1QIDDPCEV6TGP]
module.invitations.aws_cloudfront_public_key.invitation: Refreshing state... [id=K7Y686Q2ZTZD3]
module.invitations.aws_cognito_identity_pool.invitation: Refreshing state... [id=us-east-2:7a98c47f-5732-41b8-a772-7d5fd220f6ed]
module.invitations.aws_dynamodb_table.invitation: Refreshing state... [id=invitation]
module.s3website["davidbornitz.dev"].aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=EY0LKW0B60BRA]
module.invitations.aws_s3_bucket.bucket: Refreshing state... [id=invitation.davidbornitz.dev-f46c3b09]
module.s3website["davidbornitz.dev"].aws_s3_bucket.bucket: Refreshing state... [id=davidbornitz.dev-3a4610a4]
aws_route53_zone.davidbornitz: Refreshing state... [id=Z04601461HBLV7APEL0VR]
module.s3website["resume.davidbornitz.dev"].aws_s3_bucket.bucket: Refreshing state... [id=resume.davidbornitz.dev-c1e99e80]
module.invitations.aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=E2BP1AO2KL43L]
module.invitations.aws_sns_topic.invitation_updates: Refreshing state... [id=arn:aws:sns:us-east-2:085879623427:invitation-updates]
aws_acm_certificate.davidbornitz: Refreshing state... [id=arn:aws:acm:us-east-1:085879623427:certificate/0c98caac-a15d-43ff-acfb-5215ebc4a3fb]
module.invitations.aws_cloudfront_key_group.invitation: Refreshing state... [id=c967c287-868f-44c0-8050-316ee5704219]
module.invitations.data.aws_iam_policy_document.invitation: Reading...
module.invitations.data.aws_iam_policy_document.invitation: Read complete after 0s [id=4041109142]
module.invitations.aws_iam_role.invitation: Refreshing state... [id=invitation]
aws_route53_record.cert_validation["davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR__b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev._CNAME]
aws_route53_record.cert_validation["*.davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR__b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev._CNAME]
module.invitations.aws_sns_topic_subscription.invitation: Refreshing state... [id=arn:aws:sns:us-east-2:085879623427:invitation-updates:7b2cf8af-456d-4407-aa3f-f48efb84abaa]
module.invitations.data.aws_iam_policy_document.invitation_role_policy: Reading...
module.invitations.data.aws_iam_policy_document.invitation_role_policy: Read complete after 0s [id=334504001]
module.invitations.aws_cognito_identity_pool_roles_attachment.invitation: Refreshing state... [id=us-east-2:7a98c47f-5732-41b8-a772-7d5fd220f6ed]
module.invitations.aws_iam_role_policy.invitation: Refreshing state... [id=invitation:invitation_policy]
aws_acm_certificate_validation.davidbornitz: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.invitations.aws_s3_bucket_website_configuration.website: Refreshing state... [id=invitation.davidbornitz.dev-f46c3b09]
module.invitations.aws_s3_object.website["stadium.jpg"]: Refreshing state... [id=stadium.jpg]
module.invitations.aws_s3_object.website["styles.css"]: Refreshing state... [id=styles.css]
module.invitations.aws_s3_object.website["index.html"]: Refreshing state... [id=index.html]
module.invitations.aws_cloudfront_distribution.invitation: Refreshing state... [id=E25BUW33MYGUXP]
module.s3website["resume.davidbornitz.dev"].aws_s3_object.website["styles.css"]: Refreshing state... [id=styles.css]
module.s3website["resume.davidbornitz.dev"].aws_s3_object.website["index.html"]: Refreshing state... [id=index.html]
module.s3website["resume.davidbornitz.dev"].aws_cloudfront_distribution.davidbornitz: Refreshing state... [id=E38ATFTVJ2UTVF]
module.s3website["davidbornitz.dev"].aws_s3_object.website["index.html"]: Refreshing state... [id=index.html]
module.s3website["davidbornitz.dev"].aws_s3_object.website["styles.css"]: Refreshing state... [id=styles.css]
module.s3website["davidbornitz.dev"].aws_cloudfront_distribution.davidbornitz: Refreshing state... [id=ES4XGAGOUF20D]
module.s3website["resume.davidbornitz.dev"].aws_s3_bucket_website_configuration.website: Refreshing state... [id=resume.davidbornitz.dev-c1e99e80]
module.s3website["davidbornitz.dev"].aws_s3_bucket_website_configuration.website: Refreshing state... [id=davidbornitz.dev-3a4610a4]
module.invitations.data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.invitations.aws_route53_record.record: Refreshing state... [id=Z04601461HBLV7APEL0VR_invitation.davidbornitz.dev_A]
module.invitations.data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=2069678242]
module.invitations.aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=invitation.davidbornitz.dev-f46c3b09]
module.s3website["davidbornitz.dev"].aws_route53_record.record: Refreshing state... [id=Z04601461HBLV7APEL0VR_davidbornitz.dev_A]
module.s3website["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.s3website["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.s3website["resume.davidbornitz.dev"].aws_route53_record.record: Refreshing state... [id=Z04601461HBLV7APEL0VR_resume.davidbornitz.dev_A]
module.s3website["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=2909630262]
module.s3website["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=1892471705]
module.s3website["resume.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=resume.davidbornitz.dev-c1e99e80]
module.s3website["davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=davidbornitz.dev-3a4610a4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.invitations.aws_iam_role_policy.invitation will be updated in-place
  ~ resource "aws_iam_role_policy" "invitation" {
        id     = "invitation:invitation_policy"
        name   = "invitation_policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  - {
                      - Action   = [
                          - "cognito-sync:*",
                          - "cognito-identity:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                    {
                        Action   = "dynamodb:PutItem"
                        Effect   = "Allow"
                        Resource = "arn:aws:dynamodb:us-east-2:085879623427:table/invitation"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.invitations.aws_s3_object.website["envelope2.jpg"] will be created
  + resource "aws_s3_object" "website" {
      + acl                    = (known after apply)
      + bucket                 = "invitation.davidbornitz.dev-f46c3b09"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=0"
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "336e9e871d987230dcec769146aaa1bf"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "envelope2.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "modules/invitations/../../content/invitation.davidbornitz.dev//envelope2.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.invitations.aws_s3_object.website["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "website" {
      ~ etag                   = "11f0beef844d15de8d7949752d8ce5dc" -> "06b540cd7864b07ba27a41a501dfaa68"
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.invitations.aws_s3_object.website["main.js"] will be created
  + resource "aws_s3_object" "website" {
      + acl                    = (known after apply)
      + bucket                 = "invitation.davidbornitz.dev-f46c3b09"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=0"
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "a5f76417262bf7104ef0ba5a640f3de8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "main.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "modules/invitations/../../content/invitation.davidbornitz.dev//main.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>
*Pushed by: @davidbornitz, Action: `pull_request`*